In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math as math

frame=pd.read_csv("./data/mammals.csv")

In [2]:
frame.head()

              name     body  brain
0       Arctic fox    3.385   44.5
1       Owl monkey    0.480   15.5
2  Mountain beaver    1.350    8.1
3              Cow  465.000  423.0
4        Grey wolf   36.330  119.5

In [3]:
frame.columns

Index(['name', 'body', 'brain'], dtype='object')

In [4]:
frame.columns=["name","bodyKG","brainKG"]

In [5]:
frame.columns

Index(['name', 'bodyKG', 'brainKG'], dtype='object')

In [6]:
frame.head()

              name   bodyKG  brainKG
0       Arctic fox    3.385     44.5
1       Owl monkey    0.480     15.5
2  Mountain beaver    1.350      8.1
3              Cow  465.000    423.0
4        Grey wolf   36.330    119.5

In [7]:
newColumnNames= {"bodyKG":"body_KG","brainKG":"brain_KG"}

In [10]:
frame.rename(columns=newColumnNames, inplace=True)

In [11]:
frame.head()

              name  body_KG  brain_KG
0       Arctic fox    3.385      44.5
1       Owl monkey    0.480      15.5
2  Mountain beaver    1.350       8.1
3              Cow  465.000     423.0
4        Grey wolf   36.330     119.5

In [12]:
frame=pd.read_csv("./data/mammals.csv",index_col="name")

In [13]:
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Cow              465.000  423.0
Grey wolf         36.330  119.5

In [14]:
frame.rename(index={"Cow":"Land Cow"},inplace=True)

In [15]:
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land Cow         465.000  423.0
Grey wolf         36.330  119.5

In [16]:
frameCopy=frame
frame.head()

                    body  brain
name
Arctic fox         3.385   44.5
Owl monkey         0.480   15.5
Mountain beaver    1.350    8.1
Land Cow         465.000  423.0
Grey wolf         36.330  119.5

In [17]:
frameCopy.loc["Arctic fox","body"] =5

In [18]:
frameCopy.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land Cow         465.00  423.0
Grey wolf         36.33  119.5

In [19]:
frame.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land Cow         465.00  423.0
Grey wolf         36.33  119.5

In [21]:
frameCopy = frame.copy()
frameCopy.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land Cow         465.00  423.0
Grey wolf         36.33  119.5

In [22]:
frameCopy.loc["Grey wolf","body"] = 40

In [24]:
frameCopy.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land Cow         465.00  423.0
Grey wolf         40.00  119.5

In [25]:
frame.head()

                   body  brain
name
Arctic fox         5.00   44.5
Owl monkey         0.48   15.5
Mountain beaver    1.35    8.1
Land Cow         465.00  423.0
Grey wolf         36.33  119.5